## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.quicksight_vpc_connection_ec2 will be created
  + resource "aws_iam_policy" "quicksight_vpc_connection_ec2" {
      + arn         = (known after apply)
      + description = "EC2 permissions for the Quicksight VPC connection"
      + id          = (known after apply)
      + name        = "quicksight-vpc-connection-ec2"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.quicksight_vpc_connection_iam will be created
  + resource "aws_iam_policy" "quicksight_vpc_connection_iam" {
      + arn         = (known after apply)
      + description = "IAM permissions for the Quicksight VPC connection"
      + id          = (known after apply)
      + name        = "quicksight-vpc-connection-iam"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:GetRole",
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRole",
                          + "iam:AttachRolePolicy",
                          + "iam:CreateRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::239043911459:role/service-role/aws-quicksight-service-role-v0",
                          + "arn:aws:iam::239043911459:role/service-role/aws-quicksight-s3-consumers-role-v0",
                        ]
                      + Sid      = "VisualEditor0"
                    },
                  + {
                      + Action   = [
                          + "iam:ListPolicies",
                          + "iam:GetPolicyVersion",
                          + "iam:GetRole",
                          + "iam:GetPolicy",
                          + "iam:ListPolicyVersions",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:GenerateServiceLastAccessedDetails",
                          + "iam:ListEntitiesForPolicy",
                          + "iam:ListPoliciesGrantingServiceAccess",
                          + "iam:ListRoles",
                          + "iam:GetServiceLastAccessedDetails",
                          + "iam:ListAccountAliases",
                          + "iam:ListRolePolicies",
                          + "s3:ListAllMyBuckets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "VisualEditor1"
                    },
                  + {
                      + Action   = [
                          + "iam:DeletePolicy",
                          + "iam:CreatePolicy",
                          + "iam:CreatePolicyVersion",
                          + "iam:DeletePolicyVersion",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::239043911459:policy/service-role/AWSQuickSightIAMPolicy",
                          + "arn:aws:iam::239043911459:policy/service-role/AWSQuickSightRDSPolicy",
                          + "arn:aws:iam::239043911459:policy/service-role/AWSQuickSightS3Policy",
                          + "arn:aws:iam::239043911459:policy/service-role/AWSQuickSightRedshiftPolicy",
                          + "arn:aws:iam::239043911459:policy/service-role/AWSQuickSightS3ConsumersPolicy",
                        ]
                      + Sid      = "VisualEditor2"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.vpc_connection_role will be created
  + resource "aws_iam_role" "vpc_connection_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "quicksight.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ec2-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "ec2-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.iam-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "iam-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_quicksight_vpc_connection.rds will be created
  + resource "aws_quicksight_vpc_connection" "rds" {
      + arn                 = (known after apply)
      + availability_status = (known after apply)
      + aws_account_id      = (known after apply)
      + id                  = (known after apply)
      + name                = "Quicksight RDS connection"
      + role_arn            = (known after apply)
      + security_group_ids  = [
          + "sg-0c7f4c2a59629c052",
        ]
      + subnet_ids          = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all            = {}
      + vpc_connection_id   = "vpc-097508d1f5e243195"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

23 tests, 17 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
